// С клавиатуры считывается массив чисел через запятую в виде: 1,3,4,5,6,7,8,3,4
// Получить новый массив, в котором будут квадраты четных чисел 16,36,64,16
// НЕЛЬЗЯ ИСПОЛЬЗОВАТЬ split ИДЕАЛЬНО - если будет алгоритм(БС) основного действия

//то что делали в группе)

/*Console.WriteLine("Введите числа для массива через запятую");


int str = Console.ReadLine;
string str = Replace(str, ',', ' ');

int[] array = { str };
int index = 0;
int length = array.Length;
while (index < length)
{
    if (array[index] % 2 == 0)
    {
        Console.Write(array[index] * array[index] + ", ");
    }
    index++;
}

*/

// с Сергеем

//Определить подзадачи (декомпозиция)


