// Задайте двумерный массив. Напишите программу, которая поменяет местами первую и последнюю строку массива.
// не решена

/*
//заполняет массив
void ArrayFill (int[,] matrix1)
{
    for (int i = 0; i < 5; i++)
    {
    for (int j = 0; j < 5; j++)
        {
        matrix1[i, j] = new Random().Next(1, 10);
        }
    }
}

//выводит матрицу в консоль
void ArrayPrint (int[,] matrix1)
{
   for (int i = 0; i < 5; i++)
    {
    for (int j = 0; j < 5; j++)
        {
        Console.Write($"{matrix1[i, j] } ");
        }
    Console.WriteLine();
    }
}

// метод перестановки строк в матрице

void Array(int[,] matrix2)
{
    for (int i = 0; i < 5; i++)
    {
    for (int j = 0; j < 5; j++)
        {
        Console.Write($"{matrix2[i, j] } ");
        }
    Console.WriteLine();
    }
}

int[,] matrix1 = new int[5, 5];
int[,] matrix2 = new int[5, 5];

ArrayFill(matrix1);
ArrayPrint(matrix1);

Console.WriteLine();

ArrayFill(matrix2);
ArrayPrint(matrix2);
*/




